; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v7 ?v12)
             (pred_9 ?v11 ?v4)
             (pred_12 ?v7 ?v4)
             (pred_4 ?v6 ?v7 )
	     (pred_7 ?v7)
             (pred_1 ?v5)
             (pred_11 ?v11)
             (pred_10 ?v4)
             (pred_5 ?v7)
             (pred_3 ?v11)
             (pred_8 ?v7)
             (pred_6 ))



(:action op_1
:parameters (?v13 ?v8 ?v9 ?v1)
:precondition (and (pred_1 ?v13) (pred_1 ?v8) (pred_11 ?v9) (pred_10 ?v1)
          (pred_2 ?v13 ?v8) (pred_9 ?v9 ?v1)
                   (pred_12 ?v8 ?v1) (pred_7 ?v13) 
                   (pred_5 ?v8) (pred_3 ?v9))
:effect (and  (pred_8 ?v8) (not (pred_5 ?v8))))


(:action op_5
:parameters (?v13 ?v10)
:precondition (and (pred_1 ?v13) (pred_1 ?v10)
               (pred_7 ?v13) (pred_2 ?v13 ?v10) (pred_8 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v13))))

(:action op_4
:parameters (?v13 ?v9)
:precondition (and (pred_1 ?v13) (pred_11 ?v9) 
                  (pred_7 ?v13) (pred_4 ?v9 ?v13) (pred_6 ))
:effect (and (pred_3 ?v9)
   (not (pred_4 ?v9 ?v13)) (not (pred_6 ))))


(:action op_3
:parameters (?v13 ?v2 ?v3)
:precondition (and (pred_1 ?v13) (pred_11 ?v2) (pred_11 ?v3)
                  (pred_7 ?v13) (pred_3 ?v3) (pred_4 ?v2 ?v13))
:effect (and (pred_3 ?v2) (pred_4 ?v3 ?v13)
        (not (pred_3 ?v3)) (not (pred_4 ?v2 ?v13))))

(:action op_2
:parameters (?v13 ?v9)
:precondition (and (pred_1 ?v13) (pred_11 ?v9) 
                  (pred_7 ?v13) (pred_3 ?v9))
:effect (and (pred_6 ) (pred_4 ?v9 ?v13) (not (pred_3 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_09 obj_20 obj_19 obj_22 obj_08 obj_27 obj_02 obj_01 obj_12 obj_26 obj_21 obj_16 obj_31 obj_15 obj_06 obj_14 obj_10 obj_29 obj_30 obj_25 obj_03 obj_17 obj_28 obj_24
    obj_18 obj_23 obj_11
    obj_05 obj_04 obj_07
    )

    (:init
       (pred_6)

       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_1 obj_08)
       (pred_1 obj_27)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_26)
       (pred_1 obj_21)
       (pred_1 obj_16)
       (pred_1 obj_31)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_29)
       (pred_1 obj_30)
       (pred_1 obj_25)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_28)
       (pred_1 obj_24)
       (pred_10 obj_18)
       (pred_10 obj_23)
       (pred_10 obj_11)
       (pred_11 obj_05)
       (pred_11 obj_04)
       (pred_11 obj_07)

       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_09 obj_27)
       (pred_2 obj_09 obj_20)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_20 obj_02)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_22 obj_12)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_08 obj_26)
       (pred_2 obj_08 obj_27)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_27 obj_21)
       (pred_2 obj_27 obj_02)
       (pred_2 obj_27 obj_09)
       (pred_2 obj_27 obj_08)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_02 obj_27)
       (pred_2 obj_01 obj_31)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_12 obj_22)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_26 obj_08)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_21 obj_27)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_16 obj_31)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_31 obj_29)
       (pred_2 obj_31 obj_15)
       (pred_2 obj_31 obj_01)
       (pred_2 obj_31 obj_16)
       (pred_2 obj_15 obj_30)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_31)
       (pred_2 obj_06 obj_25)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_26)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_10)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_10 obj_29)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_10 obj_14)
       (pred_2 obj_29 obj_28)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_29 obj_31)
       (pred_2 obj_29 obj_10)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_30 obj_15)
       (pred_2 obj_30 obj_29)
       (pred_2 obj_25 obj_03)
       (pred_2 obj_25 obj_06)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_03 obj_25)
       (pred_2 obj_17 obj_28)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_28 obj_29)
       (pred_2 obj_28 obj_17)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_28)
       (pred_5 obj_27)
       (pred_5 obj_17)
       (pred_5 obj_12)
       (pred_12  obj_27 obj_18)
       (pred_12  obj_17 obj_23)
       (pred_12  obj_12 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_20)
       (pred_8 obj_19)
       (pred_8 obj_22)
       (pred_8 obj_08)
       (pred_8 obj_02)
       (pred_8 obj_01)
       (pred_8 obj_26)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_31)
       (pred_8 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_29)
       (pred_8 obj_30)
       (pred_8 obj_25)
       (pred_8 obj_03)
       (pred_8 obj_28)
       (pred_8 obj_24)

       (pred_9  obj_05 obj_18)
       (pred_9  obj_04 obj_23)
       (pred_9  obj_07 obj_11)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_04 obj_02)
       (pred_4 obj_07 obj_30)
       (pred_7 obj_02)
    )

    (:goal (and
       (pred_4 obj_07 obj_01)
    ))
(:constraints
  (always (not (pred_7 obj_31)))
)
)

; plan
1. (op_5 obj_02 obj_16)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_16)
   goals met: 0 of 1
2. (op_5 obj_16 obj_10)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_29)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_29)
   goals met: 0 of 1
4. (op_5 obj_29 obj_30)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_30)
   goals met: 0 of 1
5. (op_4 obj_30 obj_07)
   deleted: (pred_4 obj_07 obj_30) (pred_6)
   added: (pred_3 obj_07)
   goals met: 0 of 1
6. (op_5 obj_30 obj_15)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_15)
   goals met: 0 of 1
7. (op_1 obj_15 obj_12 obj_07 obj_11)
   deleted: (pred_5 obj_12)
   added: (pred_8 obj_12)
   goals met: 0 of 1
8. (op_5 obj_15 obj_12)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_12)
   goals met: 0 of 1
9. (op_5 obj_12 obj_01)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_01)
   goals met: 0 of 1
10. (op_2 obj_01 obj_07)
   deleted: (pred_3 obj_07)
   added: (pred_6) (pred_4 obj_07 obj_01)
   goals met: 1 of 1
